Repository: Tknika/Blockchain-FPEuskadi
Catalog: Garapena/Pilotoak/EkozirAPP/app/translations/*/LC_MESSAGES/messages.po
Languages: es, eu

source: Ekozir Private Messaging
es: Ekozir Mensajería Privada
eu: Ekozir Mezu Pribatuak

source: Encrypted Group Messages for a Circular Economy — sign up with username and password to get started.
es: Mensajes de Grupo Cifrados para una Economía Circular — regístrate con nombre de usuario y contraseña para comenzar.
eu: Ekonomia Zirkularrerako Talde Mezu Zifratuak — hasi erabiltzaile-izena eta pasahitza erabiliz.

source: Ekozir Dashboard
es: Panel de Control Ekozir
eu: Ekozir Aire-panel

source: Logged in as:
es: Sesión iniciada como:
eu: Hau bezala saioa hasita:

source: Copy Public Key
es: Copiar Clave Pública
eu: Gako Publikoa Kopiatu

source: Copied!
es: ¡Copiado!
eu: Kopiatuta!

source: Logout
es: Cerrar Sesión
eu: Saioa Itxi

source: Login
es: Iniciar Sesión
eu: Saioa Hasi

source: Sign Up
es: Registrarse
eu: Erregistratu

source: Cancel
es: Cancelar
eu: Utzi

source: Password
es: Contraseña
eu: Pasahitza

source: Your username
es: Tu nombre de usuario
eu: Zure erabiltzaile-izena

source: Your password
es: Tu contraseña
eu: Zure pasahitza

source: Enter your password to access your groups and messages.
es: Ingresa tu contraseña para acceder a tus grupos y mensajes.
eu: Sartu zure pasahitza zure taldeak eta mezuak atzitzeko.

source: Create a new account. Your username will be permanently associated with your account and cannot be changed. Your password must be complex because it is used to generate your encryption keys for accessing all your data. Choose a strong password and remember it—if you lose it, you will lose access to your account and data.
es: Crea una nueva cuenta. <strong>Tu nombre de usuario estará permanentemente asociado con tu cuenta y no se puede cambiar</strong>.<br/>Tu contraseña debe ser compleja (12 o más caracteres, mayúsculas, minúsculas, números y caracteres especiales) porque se usa para generar tus claves de cifrado para acceder a todos tus datos.<br/><strong>Elige una contraseña segura y recuérdala—si la pierdes, perderás el acceso a tu cuenta y datos</strong>.
eu: Sortu kontu berri bat. <strong>Zure erabiltzaile-izena etengabe egongo da zure kontuarekin lotuta, eta ezin da aldatu</strong>.<br/>Zure pasahitzak konplexua izan behar du (12 karaktere edo gehiago, letra larriak, xeheak, zenbakiak eta karaktere bereziak), zure zifratze-gakoak sortzeko erabiltzen delako zure datu guztietara sartzeko.<br/><strong>Aukeratu pasahitz seguru bat eta gogoratu, galtzen baduzu, zure konturako eta datuetarako sarbidea galduko duzu</strong>.

source: Enter username and password to sign up.
es: Ingresa nombre de usuario y contraseña para registrarte.
eu: Sartu erabiltzaile-izena eta pasahitza erregistratzeko.

source: Create Group
es: Crear Grupo
eu: Taldea Sortu

source: Define a group name. You can add members later in the Manage Membership section.
es: Define un nombre de grupo. Puedes agregar miembros más tarde en la sección Gestionar Membresía.
eu: Definitu talde-izen bat. Kideak geroago gehi ditzakezu Kideen Kudeaketa atalean.

source: Group name
es: Nombre del grupo
eu: Talde-izena

source: Manage Membership
es: Gestionar Membresía
eu: Kideen Kudeaketa

source: Add or remove participants when you are the group creator. Paste the public key (JSON format) of the member you want to add.
es: Agrega o elimina participantes cuando eres el creador del grupo. Pega la clave pública (formato JSON) del miembro que deseas agregar.
eu: Gehitu edo kendu parte-hartzaileak taldearen sortzailea zarenean. Itsatsi gehitu nahi duzun kidearen gako publikoa (JSON formatua).

source: Select one of your groups
es: Selecciona uno de tus grupos
eu: Aukeratu zure taldeetako bat

source: Paste public key (JSON format) here...
es: Pega la clave pública (formato JSON) aquí...
eu: Itsatsi gako publikoa (JSON formatua) hemen...

source: Add Member
es: Agregar Miembro
eu: Kidea Gehitu

source: Remove Member
es: Eliminar Miembro
eu: Kidea Kendu

source: Send Message
es: Enviar Mensaje
eu: Mezua Bidali

source: Select a group and choose recipients. Messages are stored encrypted.
es: Selecciona un grupo y elige destinatarios. Los mensajes se almacenan cifrados.
eu: Aukeratu talde bat eta hautatu hartzaileak. Mezuak zifratuta gordetzen dira.

source: Select recipients:
es: Selecciona destinatarios:
eu: Hautatu hartzaileak:

source: Type your message here (it will be encrypted automatically before sending)
es: Escribe tu mensaje aquí (se cifrará automáticamente antes de enviar)
eu: Idatzi zure mezua hemen (bidali aurretik automatikoki zifratuko da)

source: Your Groups and Messages
es: Tus Grupos y Mensajes
eu: Zure Taldeak eta Mezuak

source: Your Groups
es: Tus Grupos
eu: Zure Taldeak

source: Select a group to inspect members and messages.
es: Selecciona un grupo para inspeccionar miembros y mensajes.
eu: Aukeratu talde bat kideak eta mezuak ikusteko.

source: Refresh Groups
es: Actualizar Grupos
eu: Taldeak Eguneratu

source: Group Messages
es: Mensajes del Grupo
eu: Talde Mezuak

source: View encrypted content, keys, and confirmation status.
es: Ver contenido cifrado, claves y estado de confirmación.
eu: Ikusi zifratutako edukia, gakoak eta berrespen-egoera.

source: Not logged in
es: No has iniciado sesión
eu: Ez duzu saioa hasi

source: Login successful!
es: ¡Sesión iniciada con éxito!
eu: Saioa ondo hasi da!

source: Login failed.
es: Error al iniciar sesión.
eu: Saioa hasteak huts egin du.

source: This user is not signed up. Please use the Sign Up button to create an account.
es: Este usuario no está registrado. Por favor, usa el botón Registrarse para crear una cuenta.
eu: Erabiltzaile hau ez dago erregistratuta. Mesedez, erabili Erregistratu botoia kontu bat sortzeko.

source: Login error: %(error)s
es: Error al iniciar sesión: %(error)s
eu: Saioa hasteko errorea: %(error)s

source: Sign up successful!
es: ¡Registro exitoso!
eu: Erregistroa ondo egin da!

source: Sign up error: %(error)s
es: Error al registrarse: %(error)s
eu: Erregistro errorea: %(error)s

source: A user with this password already exists. Please use a different password.
es: Ya existe un usuario con esta contraseña. Por favor, usa una contraseña diferente.
eu: Pasahitz honekin erabiltzaile bat dago dagoeneko. Mesedez, erabili pasahitz desberdin bat.

source: Please enter username and password.
es: Por favor, ingresa nombre de usuario y contraseña.
eu: Mesedez, sartu erabiltzaile-izena eta pasahitza.

source: Password does not meet complexity requirements. Please check the requirements above.
es: La contraseña no cumple con los requisitos de complejidad. Por favor, verifica los requisitos arriba.
eu: Pasahitzak ez ditu konplexutasun-eskakizunak betetzen. Mesedez, egiaztatu goiko eskakizunak.

source: Creating account and registering on blockchain...
es: Creando cuenta y registrando en blockchain...
eu: Kontua sortzen eta blockchain-ean erregistratzen...

source: Processing blockchain transaction...
es: Procesando transacción de blockchain...
eu: Blockchain transakzioa prozesatzen...

source: Logging in...
es: Iniciando sesión...
eu: Saioa hasten...

source: Creating group on blockchain...
es: Creando grupo en blockchain...
eu: Blockchain-ean taldea sortzen...

source: Adding member to group on blockchain...
es: Agregando miembro al grupo en blockchain...
eu: Blockchain-ean kidea taldera gehitzen...

source: Removing member from group on blockchain...
es: Eliminando miembro del grupo en blockchain...
eu: Blockchain-ean kidea taldetik kentzen...

source: Encrypting message and preparing to send...
es: Cifrando mensaje y preparando para enviar...
eu: Mezua zifratzen eta bidaltzeko prestatzen...

source: Sending message %(current)s/%(total)s to blockchain...
es: Enviando mensaje %(current)s/%(total)s a blockchain...
eu: %(current)s/%(total)s mezua blockchain-era bidaltzen...

source: No groups found.
es: No se encontraron grupos.
eu: Ez da talderik aurkitu.

source: Login to view your groups.
es: Inicia sesión para ver tus grupos.
eu: Hasi saioa zure taldeak ikusteko.

source: Login to view group messages.
es: Inicia sesión para ver mensajes del grupo.
eu: Hasi saioa talde mezuak ikusteko.

source: Select a group to view its messages.
es: Selecciona un grupo para ver sus mensajes.
eu: Aukeratu talde bat bere mezuak ikusteko.

source: Group created successfully!
es: ¡Grupo creado con éxito!
eu: Taldea ondo sortu da!

source: Failed to create group.
es: Error al crear grupo.
eu: Taldea sortzea huts egin du.

source: Member added successfully!
es: ¡Miembro agregado con éxito!
eu: Kidea ondo gehitu da!

source: Member removed successfully!
es: ¡Miembro eliminado con éxito!
eu: Kidea ondo kendu da!

source: Failed to add member.
es: Error al agregar miembro.
eu: Kidea gehitzea huts egin du.

source: Failed to remove member.
es: Error al eliminar miembro.
eu: Kidea kentzea huts egin du.

source: No other members in this group.
es: No hay otros miembros en este grupo.
eu: Ez dago beste kiderik talde honetan.

source: Message sent successfully!
es: ¡Mensaje enviado con éxito!
eu: Mezua ondo bidali da!

source: Failed to send message.
es: Error al enviar mensaje.
eu: Mezua bidaltzea huts egin du.

source: No messages stored for this group yet.
es: Aún no hay mensajes almacenados para este grupo.
eu: Oraindik ez da mezurik gorde talde honetarako.

source: No messages available for you in this group.
es: No hay mensajes disponibles para ti en este grupo.
eu: Ez dago mezu eskuragarririk zuretzat talde honetan.

source: Sent Messages
es: Mensajes Enviados
eu: Bidalitako Mezuak

source: Received Messages
es: Mensajes Recibidos
eu: Jasotako Mezuak

source: No sent messages
es: No hay mensajes enviados
eu: Ez dago bidalitako mezurik

source: No received messages
es: No hay mensajes recibidos
eu: Ez dago jasotako mezurik

source: To:
es: Para:
eu: Nori:

source: From:
es: De:
eu: Nork:

source: Confirmed
es: Confirmado
eu: Berretsita

source: Pending confirmation
es: Confirmación pendiente
eu: Berrespenaren zain

source: Confirm Message
es: Confirmar Mensaje
eu: Mezua Berretsi

source: Message confirmed successfully!
es: ¡Mensaje confirmado con éxito!
eu: Mezua ondo berretsi da!

source: Failed to confirm message.
es: Error al confirmar mensaje.
eu: Mezua berrestea huts egin du.

source: Failed to decrypt message
es: Error al descifrar mensaje
eu: Mezua deszifratzea huts egin du

source: Unknown
es: Desconocido
eu: Ezezaguna

source: Error
eu: Errorea

source: Success
es: Éxito
eu: Arrakasta

source: Loading...
es: Cargando...
eu: Kargatzen...

source: Logged in as %(username)s
es: Sesión iniciada como %(username)s
eu: %(username)s bezala saioa hasita

source: No public key available to copy.
es: No hay clave pública disponible para copiar.
eu: Ez dago kopiatzeko gako publikorik.

source: Public key copied to clipboard!
es: ¡Clave pública copiada al portapapeles!
eu: Gako publikoa arbelera kopiatu da!

source: Failed to copy public key to clipboard.
es: Error al copiar la clave pública al portapapeles.
eu: Gako publikoa arbelera kopiatzea huts egin du.

source: Sign up failed
es: Registro fallido
eu: Erregistroa huts egin du

source: Logout error
es: Error al cerrar sesión
eu: Saioa ixteko errorea

source: Group name cannot be empty.
es: El nombre del grupo no puede estar vacío.
eu: Talde-izena ezin da hutsik egon.

source: Failed to load groups.
es: Error al cargar grupos.
eu: Taldeak kargatzea huts egin du.

source: Please select a group.
es: Por favor, selecciona un grupo.
eu: Mesedez, aukeratu talde bat.

source: Please paste the public key (JSON format) of the member you want to add.
es: Por favor, pega la clave pública (formato JSON) del miembro que deseas agregar.
eu: Mesedez, itsatsi gehitu nahi duzun kidearen gako publikoa (JSON formatua).

source: Please paste the public key (JSON format) of the member you want to remove.
es: Por favor, pega la clave pública (formato JSON) del miembro que deseas eliminar.
eu: Mesedez, itsatsi kendu nahi duzun kidearen gako publikoa (JSON formatua).

source: Invalid public key format. Please paste a valid JSON public key (e.g., copied from another user's 'Copy Public Key' button).
es: Formato de clave pública inválido. Por favor, pega una clave pública JSON válida (por ejemplo, copiada del botón 'Copiar Clave Pública' de otro usuario).
eu: Gako publikoaren formatua baliogabea da. Mesedez, itsatsi JSON gako publiko baliozkoa (adibidez, beste erabiltzaile baten 'Gako Publikoa Kopiatu' botoitik kopiatua).

source: Invalid public key format. Please paste a valid JSON public key.
es: Formato de clave pública inválido. Por favor, pega una clave pública JSON válida.
eu: Gako publikoaren formatua baliogabea da. Mesedez, itsatsi JSON gako publiko baliozkoa.

source: Error: %(error)s Make sure the user has signed up first.
es: Error: %(error)s Asegúrate de que el usuario se haya registrado primero.
eu: Errorea: %(error)s Ziurtatu erabiltzailea lehenik erregistratu dela.

source: Error: %(error)s
eu: Errorea: %(error)s

source: Failed to load group members.
es: Error al cargar miembros del grupo.
eu: Talde kideak kargatzea huts egin du.

source: Message %(current)s/%(total)s sent!
es: ¡Mensaje %(current)s/%(total)s enviado!
eu: %(current)s/%(total)s mezua bidali da!

source: Failed to send message %(current)s/%(total)s: %(error)s
es: Error al enviar mensaje %(current)s/%(total)s: %(error)s
eu: %(current)s/%(total)s mezua bidaltzea huts egin du: %(error)s

source: Successfully sent %(count)s out of %(total)s message(s).
es: Enviados exitosamente %(count)s de %(total)s mensaje(s).
eu: %(count)s mezua %(total)s-tik ondo bidali da.

source: Please provide message content.
es: Por favor, proporciona el contenido del mensaje.
eu: Mesedez, eman mezuko edukia.

source: Please select at least one recipient.
es: Por favor, selecciona al menos un destinatario.
eu: Mesedez, hautatu gutxienez hartzaile bat.

source: Failed to load messages.
es: Error al cargar mensajes.
eu: Mezuak kargatzea huts egin du.

source: Welcome back, %(username)s!
es: ¡Bienvenido de nuevo, %(username)s!
eu: Ongi etorri berriro, %(username)s!

source: Failed to bootstrap application.
es: Error al iniciar la aplicación.
eu: Aplikazioa abiaraztea huts egin du.

source: No members yet
es: Aún no hay miembros
eu: Oraindik ez dago kiderik

source: Members: %(count)s
es: Miembros: %(count)s
eu: Kideak: %(count)s

source: Messages: %(count)s
es: Mensajes: %(count)s
eu: Mezuak: %(count)s

source: View messages
es: Ver mensajes
eu: Mezuak ikusi

source: Group Debug
es: Depuración de Grupo
eu: Talde Arazketa

source: Group
es: Grupo
eu: Taldea

source: Group Debug Information
es: Información de Depuración de Grupo
eu: Talde Arazketa Informazioa

source: Group ID
es: ID de Grupo
eu: Talde ID

source: Raw Group Data from Smart Contract
es: Datos Crudos del Grupo desde Smart Contract
eu: Talde Datu Gordinak Smart Contract-etik

source: Message Count
es: Cantidad de Mensajes
eu: Mezu Kopurua

source: Created At
es: Creado En
eu: Sortze Data

source: Unix timestamp
es: Marca de tiempo Unix
eu: Unix denbora-marka

source: Total Members:
es: Total de Miembros:
eu: Kide Guztiak:

source: Index
es: Índice
eu: Indizea

source: Public Key (JSON)
es: Clave Pública (JSON)
eu: Gako Publikoa (JSON)

source: No members found in the members array.
es: No se encontraron miembros en el array de miembros.
eu: Ez da kiderik aurkitu kideen array-ean.

source: Member Info (with Names)
es: Información de Miembros (con Nombres)
eu: Kide Informazioa (Izenekin)

source: Public Key
es: Clave Pública
eu: Gako Publikoa

source: Raw JSON Data
es: Datos JSON Crudos
eu: JSON Datu Gordina

source: No group data available.
es: No hay datos de grupo disponibles.
eu: Ez dago talde daturik eskuragarri.

source: ← Back to Dashboard
es: ← Volver al Panel
eu: ← Aire-panela itzuli
